# ******请求参数 浏览器复制过来******
"""
寻找方法：登录智联，跳转条件搜索页面，填写搜索条件，填写完毕，按F12或者右键点击检查，
        在Network中找到 resumeList 开头的连接点击，然后在右侧 headers 最下方找到 view source 点击 然后复制内容
"""

# 不可更改
AREA = {'530': '北京', '538': '上海', '763': '广州', '765': '深圳', '531': '天津', '736': '武汉', '854': '西安', '801': '成都',
        '600': '大连', '613': '长春', '599': '沈阳', '635': '南京', '702': '济南', '703': '青岛', '653': '杭州', '639': '苏州',
        '636': '无锡', '654': '宁波', '551': '重庆', '719': '郑州', '749': '长沙', '681': '福州', '682': '厦门', '622': '哈尔滨',
        '565': '石家庄', '664': '合肥', '773': '惠州', '576': '太原', '831': '昆明', '707': '烟台', '768': '佛山', '691': '南昌',
        '822': '贵阳', '548': '广东', '546': '湖北', '556': '陕西', '552': '四川', '535': '辽宁', '536': '吉林', '539': '江苏',
        '544': '山东', '540': '浙江', '549': '广西', '541': '安徽', '532': '河北', '533': '山西', '534': '内蒙古', '537': '黑龙江',
        '542': '福建', '543': '江西', '545': '河南', '547': '湖南', '550': '海南', '553': '贵州', '554': '云南', '555': '西藏',
        '557': '甘肃', '558': '青海', '559': '宁夏', '560': '新疆', '561': '香港', '562': '澳门', '563': '台湾省'}

# 不可更改
INDUSTRY = {'210500': '互联网/电子商务', '160400': '计算机软件', '160000': 'IT服务(系统/数据/维护)', '160500': '电子技术/半导体/集成电路',
            '160200': '计算机硬件', '300100': '通信/电信/网络设备', '160100': '通信/电信运营、增值服务', '160600': '网络游戏',
            '180000': '基金/证券/期货/投资', '180100': '保险', '300500': '银行', '300900': '信托/担保/拍卖/典当', '140000': '房地产/建筑/建材/工程',
            '140100': '家居/室内设计/装饰装潢', '140200': '物业管理/商业中心', '200300': '专业服务/咨询(财会/法律/人力资源等)', '200302': '广告/会展/公关',
            '201400': '中介服务', '201300': '检验/检测/认证', '300300': '外包服务', '120400': '快速消费品（食品/饮料/烟酒/日化）',
            '120200': '耐用消费品（服饰/纺织/皮革/家具/家电）', '170500': '贸易/进出口', '170000': '零售/批发', '300700': '租赁服务',
            '201100': '教育/培训/院校', '120800': '礼品/玩具/工艺美术/收藏品/奢侈品', '121000': '汽车/摩托车', '129900': '大型设备/机电设备/重工业',
            '121100': '加工制造（原料加工/模具）', '121200': '仪器仪表及工业自动化', '210600': '印刷/包装/造纸', '120700': '办公用品及设备',
            '121300': '医药/生物工程', '121500': '医疗设备/器械', '300000': '航空/航天研究与制造', '150000': '交通/运输', '301100': '物流/仓储',
            '121400': '医疗/护理/美容/保健/卫生服务', '200600': '酒店/餐饮', '200800': '旅游/度假', '210300': '媒体/出版/影视/文化传播',
            '200700': '娱乐/体育/休闲', '130000': '能源/矿产/采掘/冶炼', '120500': '石油/石化/化工', '130100': '电气/电力/水利', '201200': '环保',
            '200100': '政府/公共事业/非盈利机构', '120600': '学术/科研', '100000': '农/林/牧/渔', '100100': '跨领域经营', '990000': '其他'}

# 不可更改
SIZE = {'1': '20人以下', '2': '20-99人', '3': '100-499人', '4': '500-999人', '5': '1000-9999人', '6': '10000人以上'}

# 不可更改
NATURE = {'1': '国企', '5': '民营', '4': '合资', '2': '外商独资', '8': '股份制企业', '9': '上市公司', '3': '代表处', '6': '国家机关',
          '10': '事业单位', '11': '银行', '12': '医院', '13': '学校/下级学院', '14': '律师事务所', '15': '社会团体', '16': '港澳台公司', '7': '其它'}

WORKSTATUS = {'1': '离职', '2': '在职，可一个月内到岗', '3': '在职，不想换工作', '4': '在职，考虑换工作', '5': '应届毕业生'}
